
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.vm_contributor[0]
  * azurerm_role_assignment.vm_reader
* Delete
  * azurerm_role_assignment.vmuser_login[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.vm_contributor[0] will be created
  + resource "azurerm_role_assignment" "vm_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ad922d96-041a-4fd0-ac58-9205d3e5b33d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.vm_reader will be created
  + resource "azurerm_role_assignment" "vm_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ad922d96-041a-4fd0-ac58-9205d3e5b33d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.vmuser_login[0] will be destroyed
  # (because azurerm_role_assignment.vmuser_login is not in configuration)
  - resource "azurerm_role_assignment" "vmuser_login" {
      - id                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg/providers/Microsoft.Authorization/roleAssignments/de31a4b8-8c12-552c-ff43-5bab2c84be16" -> null
      - name                 = "de31a4b8-8c12-552c-ff43-5bab2c84be16" -> null
      - principal_id         = "ad922d96-041a-4fd0-ac58-9205d3e5b33d" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/fb879df8-f326-4884-b1cf-06f3ad86be52" -> null
      - role_definition_name = "Virtual Machine User Login" -> null
      - scope                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/edit-vm1-stg" -> null
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":659,"Program":"tfcmt","SHA1":"","Vars":{}} -->